#include <iostream>

/******************************************************************************
* main函数形参 int argc, char **argv
* argc 是argument count的缩写，表示传入main函数的参数个数；
* argv 是argument vector的缩写，传入main函数的参数个数,
* 并且第一个参数argv[0]一定是程序的名称，并且包含了程序所在的完整路径
*******************************************************************************/

/******************************************************************************
* 执行本程序
* 输入：  ./main_argc_argv ,  执行程序时传入0个参数，参数以空格分开
* 输出：       argc = 1
*             argv[0]= ./main_argc_argv
******************************************************************************/

/******************************************************************************
* 执行本程序                                                                    
* 输入：  ./main_argc_argv 10 20 30 40 50 ,  执行程序时传入5个参数，参数以空格分开
* 输出：       argc = 6
*             argv[0]= ./main_argc_argv
*             argv[1]= 10
*             argv[2]= 20
*             argv[3]= 30
*             argv[4]= 40
*             argv[5]= 50
******************************************************************************/

/*****************************************************************************
* 执行本程序
* 输入：  ./main_argc_argv I Love You Bro ,  执行程序时传入4个参数，参数以空格分开
* 输出：       argc = 5
*             argv[0]= ./main_argc_argv
*             argv[1]= I
*             argv[2]= Love
*             argv[3]= You
*             argv[4]= Bro
******************************************************************************/

using namespace std;
int main(int argc, char **argv)
{
  cout << "argc = " << argc << endl;
  for (int i = 0; i < argc; i++)
  {
    cout << "argv[" << i << "]= " << argv[i] << endl;
  }

  return 0;
}